# Task 6
# Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным.
# Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

from itertools import cycle, count

for el in count(start=3, step=1):
    print(el)
    if el == 10:
        break



my_list = ['a', 'b', 'c', 'd', 'e']
i = 5
x = cycle(my_list)
ex = ''
while ex != 'q':
    print(next(x), end='')
    ex = input()